
--로그인 
begin
--    login('이석정','2961047'); -- 교육생 미수료
--    login('현민정','1621433'); -- 교육생 수료
--    login('염현빈','1534265'); -- 관리자
    login('김수진','1928456'); -- 교사
    
end;
--select logintype from tblLogin where id = '현민정' and pw = '1621433'

/
----------------------------------
--관리자 선택
begin
    adminSelec(10);
end;
/
----------------------------------
--교사 선택
begin
    teacherSelec(10);
end;
/

----------------------------------
--교육생 선택
begin
    studentSelec(10);
end;
/
----------------------------------
--2-1-2-1. 기초 정보 목록 출력
begin
    --강의실, 교재, 과목
    basicList('과목');
end;
/
----------------------------------
--2-1-2-2. 강의실 insert
begin
    classLoomInsert(7,30);
end;
/
----------------------------------
--2-1-2-2. 걍의실 이름 수정
begin
    classLoomNameUpdate(7,8);
end;
/
----------------------------------
--2-1-2-2. 강의실 인원 수정
begin
    classLoomSuUpdate(8, 27);
end;
/
----------------------------------
--2-1-2-2. 강의실 삭제
begin
    classLoomDelete(8);
end;
/
----------------------------------
--2-1-2-2. 교재 insert
begin
    --교재명, 출판사
    bookInsert('쌍용코드','바른이름');
end;
/
----------------------------------
--2-1-2-2. 교재 이름 수정
begin
    --번호, 바꿀이름
    bookNameUpdate(42,'바른이름');
end;
/
----------------------------------
--2-1-2-2. 교재 출판사 수정
begin
    --번호, 바꿀출판사
    bookPublisherUpdate(42,'바른이름');
end;
/
----------------------------------
--2-1-2-2. 교재 출판사 삭제
begin
    --번호
    bookDelete(42);
end;
/
----------------------------------
--2-1-2-2. 교재 insert
begin
    --과목이름
    subInsert('쌍용코드');
end;
/
----------------------------------
--2-1-2-2. 교재 수정
begin
    --번호 바꿀이름
    subNameUpdate(36,'쌍용오라클');
end;
/
----------------------------------
--2-1-2-2. 교재 삭제
begin
    --번호
    subDelete(36);
end;
/


----------------------------------교육생 성적 조회 기능
begin
    --학생번호
    subSelectList(146);
end;
/
----------------------------------성적조회
begin
    --학생번호 (로그인해서 나오는 번호)
    scoreList(146, 'AWS');
end;
/
----------------------------------출석 등록
begin
    --학생번호 (로그인해서 나오는 번호)
    workIn(146);
end;
/
----------------------------------퇴근 등록(출석먼저)
begin
    --학생번호 (로그인해서 나오는 번호)
    workout(146);
end;
/
----------------------------------출석 기간조회
begin
    --학생번호 (로그인해서 나오는 번호)
    workCheck(146, '23/07/16', '23/07/17');
end;
/